[net]
height=224
width=224
channels=3

[convolutional]
filters=32
size=3
stride=2
pad=1
batch_normalize=0
activation=relu
block_name=IamNotABlock

[convolutional]
filters=128
size=1
stride=1
pad=0
batch_normalize=0
activation=relu
block_name=r1_k5_s22_e4_i32_o32_c0

[convolutional]
groups=128
filters=128
size=5
stride=2
pad=1
batch_normalize=0
activation=relu
block_name=r1_k5_s22_e4_i32_o32_c0

[convolutional]
filters=32
size=1
stride=1
pad=0
batch_normalize=0
activation=linear
block_name=r1_k5_s22_e4_i32_o32_c0

[convolutional]
filters=128
size=1
stride=1
pad=0
batch_normalize=0
activation=relu
block_name=r1_k5_s11_e4_i32_o32_c0

[convolutional]
groups=128
filters=128
size=5
stride=1
pad=1
batch_normalize=0
activation=relu
block_name=r1_k5_s11_e4_i32_o32_c0

[convolutional]
filters=32
size=1
stride=1
pad=0
batch_normalize=0
activation=linear
block_name=r1_k5_s11_e4_i32_o32_c0

[shortcut]
from=-4
activation=linear
block_name=r1_k5_s11_e4_i32_o32_c0

[convolutional]
filters=128
size=1
stride=1
pad=0
batch_normalize=0
activation=relu
block_name=r1_k5_s22_e4_i32_o64_c0

[convolutional]
groups=128
filters=128
size=5
stride=2
pad=1
batch_normalize=0
activation=relu
block_name=r1_k5_s22_e4_i32_o64_c0

[convolutional]
filters=64
size=1
stride=1
pad=0
batch_normalize=0
activation=linear
block_name=r1_k5_s22_e4_i32_o64_c0

[convolutional]
filters=256
size=1
stride=1
pad=0
batch_normalize=0
activation=relu
block_name=r1_k5_s11_e4_i64_o64_c0

[convolutional]
groups=256
filters=256
size=5
stride=1
pad=1
batch_normalize=0
activation=relu
block_name=r1_k5_s11_e4_i64_o64_c0

[convolutional]
filters=64
size=1
stride=1
pad=0
batch_normalize=0
activation=linear
block_name=r1_k5_s11_e4_i64_o64_c0

[shortcut]
from=-4
activation=linear
block_name=r1_k5_s11_e4_i64_o64_c0

[convolutional]
filters=256
size=1
stride=1
pad=0
batch_normalize=0
activation=relu
block_name=r1_k5_s22_e4_i64_o128_c0

[convolutional]
groups=256
filters=256
size=5
stride=2
pad=1
batch_normalize=0
activation=relu
block_name=r1_k5_s22_e4_i64_o128_c0

[convolutional]
filters=128
size=1
stride=1
pad=0
batch_normalize=0
activation=linear
block_name=r1_k5_s22_e4_i64_o128_c0

[convolutional]
filters=512
size=1
stride=1
pad=0
batch_normalize=0
activation=relu
block_name=r1_k5_s11_e4_i128_o128_c0

[convolutional]
groups=512
filters=512
size=5
stride=1
pad=1
batch_normalize=0
activation=relu
block_name=r1_k5_s11_e4_i128_o128_c0

[convolutional]
filters=128
size=1
stride=1
pad=0
batch_normalize=0
activation=linear
block_name=r1_k5_s11_e4_i128_o128_c0

[shortcut]
from=-4
activation=linear
block_name=r1_k5_s11_e4_i128_o128_c0

[convolutional]
filters=512
size=1
stride=1
pad=0
batch_normalize=0
activation=relu
block_name=r1_k5_s11_e4_i128_o160_c0

[convolutional]
groups=512
filters=512
size=5
stride=1
pad=1
batch_normalize=0
activation=relu
block_name=r1_k5_s11_e4_i128_o160_c0

[convolutional]
filters=160
size=1
stride=1
pad=0
batch_normalize=0
activation=linear
block_name=r1_k5_s11_e4_i128_o160_c0

[convolutional]
filters=640
size=1
stride=1
pad=0
batch_normalize=0
activation=relu
block_name=r1_k5_s11_e4_i160_o160_c0

[convolutional]
groups=640
filters=640
size=5
stride=1
pad=1
batch_normalize=0
activation=relu
block_name=r1_k5_s11_e4_i160_o160_c0

[convolutional]
filters=160
size=1
stride=1
pad=0
batch_normalize=0
activation=linear
block_name=r1_k5_s11_e4_i160_o160_c0

[shortcut]
from=-4
activation=linear
block_name=r1_k5_s11_e4_i160_o160_c0

[convolutional]
filters=640
size=1
stride=1
pad=0
batch_normalize=0
activation=relu
block_name=r1_k5_s22_e4_i160_o256_c0

[convolutional]
groups=640
filters=640
size=5
stride=2
pad=1
batch_normalize=0
activation=relu
block_name=r1_k5_s22_e4_i160_o256_c0

[convolutional]
filters=256
size=1
stride=1
pad=0
batch_normalize=0
activation=linear
block_name=r1_k5_s22_e4_i160_o256_c0

[convolutional]
filters=1024
size=1
stride=1
pad=0
batch_normalize=0
activation=relu
block_name=r1_k5_s11_e4_i256_o256_c0

[convolutional]
groups=1024
filters=1024
size=5
stride=1
pad=1
batch_normalize=0
activation=relu
block_name=r1_k5_s11_e4_i256_o256_c0

[convolutional]
filters=256
size=1
stride=1
pad=0
batch_normalize=0
activation=linear
block_name=r1_k5_s11_e4_i256_o256_c0

[shortcut]
from=-4
activation=linear
block_name=r1_k5_s11_e4_i256_o256_c0

[convolutional]
filters=1280
size=1
stride=1
pad=0
batch_normalize=0
activation=relu
block_name=IamNotABlock

[avgpool]
size=7
stride=1
block_name=None

[convolutional]
filters=1000
size=1
stride=1
pad=0
batch_normalize=0
activation=linear
block_name=IamNotABlock

